# InitialFluxIntensity Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InitialFluxIntensity Properties
InitialFluxIntensity Class See Also
---
The InitialFluxIntensity type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Flux | The flux intensity value. |
| InitialIntensityValue | The calculated initial intensity value.  (Inherited from InitialIntensity.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from InitialIntensity.) |

# See Also
InitialFluxIntensity Class
Autodesk.Revit.DB.Lighting Namespace